import 'package:app/model/meeting.dart';

class TestData {
  List<List<Meeting>> meetings = [
    [],
    [],
    [],
    [
      Meeting(0, 0, '20220803', '13:00', '14:00', '프론트 회의', '인턴회의', '반복 없음'),
      Meeting(1, 1, '20220803', '15:00', '16:00', '백엔드 회의', '인턴회의', '매주 반복')
    ],
    [],
    [],
    [],
    [
      Meeting(2, 2, '20220807', '13:00', '14:00', '프론트 회의', '인턴회의', '반복 없음'),
      Meeting(3, 1, '20220807', '15:00', '16:00', '백엔드 회의', '인턴회의', '반복 없음')
    ],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    [],
    []
  ];
}
